Repository: pypi-data/pypi-mirror-182
Catalog: packages/z3cform.locationwidget/z3cform.locationwidget-1.1.0.tar.gz/z3cform.locationwidget-1.1.0/src/z3cform/locationwidget/locales/*/LC_MESSAGES/z3cform.locationwidget.po
Languages: ca

source: Define a key to use. Get one: https://developers.google.com/maps/documentation/javascript/get-api-key
ca: Definir una clau per a l'ús. Aconseguir-ne una: https://developers.google.com/maps/documentation/javascript/get-api-key

source: Google Maps Api key
ca: Clau de la Api de Google Maps

source: Installs the z3cform.locationwidget add-on.
ca: Instal·la el z3cform.locationwidget add-on.

source: Location
ca: Ubicació

source: Location Widget Settings
ca: Configuració - Location Widget

source: Map center
ca: Centre del mapa

source: Set a point to initialize widget maps.
ca: Establir un punt per inicialitzar el widget de google maps.

source: Show coordinates
ca: Mostra les coordenades

source: Type an address
ca: Escriviu una adreça

source: Uninstalls the z3cform.locationwidget add-on.
ca: Desinstal·la z3cform.locationwidget add-on.
